In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [3]:
df_tips = sns.load_dataset('tips')
df_tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

On peut grouper les données avec un groupy.

In [4]:
df_tips_gb = df_tips.groupby(['sex', 'smoker'])
df_tips_gb

On peut ensuite appliquer des méthodes a ces groupes pour obtenir de l'information par groupe.  
Exemple :

In [5]:
df_tips_gb.size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [7]:
df_tips_gb.mean()

               total_bill       tip      size
sex    smoker
Male   Yes      22.284500  3.051167  2.500000
       No       19.791237  3.113402  2.711340
Female Yes      17.977879  2.931515  2.242424
       No       18.105185  2.773519  2.592593

In [8]:
df_tips_gb.first()

               total_bill   tip  day    time  size
sex    smoker
Male   Yes          38.01  3.00  Sat  Dinner     4
       No           10.34  1.66  Sun  Dinner     3
Female Yes           3.07  1.00  Sat  Dinner     1
       No           16.99  1.01  Sun  Dinner     2

In [10]:
df_tips_gb.day.nunique()

sex     smoker
Male    Yes       4
        No        4
Female  Yes       4
        No        4
Name: day, dtype: int64

On trouvera une partie des fonctions d'aggrégations possibles [ici](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#aggregation).

### Agg

In [11]:
df_tips_agg = df_tips_gb.agg({
    'tip': ['mean', 'min'],
    'day': 'first',
    'total_bill': 'size'
})

df_tips_agg

                    tip         day total_bill
                   mean   min first       size
sex    smoker
Male   Yes     3.051167  1.00   Sat         60
       No      3.113402  1.25   Sun         97
Female Yes     2.931515  1.00   Sat         33
       No      2.773519  1.00   Sun         54

On remarque que l'on obtient une multi-index. On peut revenir à un index normal en utilsant reset_index().

In [12]:
df_tips_agg.reset_index()

      sex smoker       tip         day total_bill
                      mean   min first       size
0    Male    Yes  3.051167  1.00   Sat         60
1    Male     No  3.113402  1.25   Sun         97
2  Female    Yes  2.931515  1.00   Sat         33
3  Female     No  2.773519  1.00   Sun         54

On peut aussi reset l'index des colonnes:

In [17]:
(
df_tips_agg
    .reset_index()
    .droplevel(0, axis=1)
)

                    mean   min first  size
0    Male  Yes  3.051167  1.00   Sat    60
1    Male   No  3.113402  1.25   Sun    97
2  Female  Yes  2.931515  1.00   Sat    33
3  Female   No  2.773519  1.00   Sun    54